# Brewfile - Developer Essentials + Utilities
# Usage: brew bundle install
#
# Uninstall commands:
# brew uninstall <package>                    # Basic uninstall (brew packages)
# brew uninstall --force <package>           # Force removal (brew packages)
# brew uninstall --cask <package>            # Basic cask uninstall
# brew uninstall --cask --zap <package>      # Complete removal with all files (recommended)
# brew uninstall --cask --force <package>    # Force removal if normal fails
# brew uninstall --cask --zap --force <package>  # Both (if needed)
# mas uninstall <app-id>                     # Mac App Store apps

# Essential Command Line Tools
brew "git"                      # Version control (overrides macOS system git)
brew "gh"                       # GitHub CLI for repository
brew "curl"                     # HTTP requests
brew "wget"                     # Downloads
brew "jq"                       # JSON processor
brew "tree"                     # Directory structure
brew "node"                     # Node.js for JavaScript development
brew "ffmpeg"                   # Video processing
brew "nmap"                     # Network scanner
brew "telnet"                   # Telnet client
brew "iperf3"                   # Network performance testing


# AI Development Tools
brew "codex"                    # OpenAI Codex CLI tool

# Better CLI Tools
brew "ripgrep"                  # Fast text search (rg)
brew "bat"                      # cat with syntax highlighting
brew "eza"                      # Better ls with colors

# Mac App Store CLI
brew "mas"                      # Command line interface for Mac App Store

# macOS Dock Management
brew "dockutil"                 # Manage Dock items from command line

# Terminal Extensions
brew "zsh-autosuggestions"      # Tab completion
brew "zsh-syntax-highlighting"  # Syntax colors in terminal

# Security & Encryption
# GPG Suite Beta (2024.1b3) with MailKit - install manually from gpgtools.org
# Homebrew version is outdated

# Essential GUI Apps
cask "visual-studio-code"       # Code editor
cask "sublime-text"             # Lightweight code editor
cask "google-chrome"            # Browser with dev tools
cask "iterm2"                   # Better terminal
cask "docker-desktop"           # Docker Desktop (includes CLI + GUI)
cask "claude"                   # Claude Desktop (full version)
#cask "grok"                    # Grok Desktop (full version)
cask "transmit"                 # File transfer client
cask "hiddenbar"                # Hide menu bar icons
cask "mark-text"                # Markdown editor
cask "tunnelblick"              # OpenVPN client
cask "thunderbird"              # Email client
cask "balenaetcher"             # OS image flasher
cask "syncthing-app"                # File synchronization tool
cask "alfred"                   # Productivity app launcher
#cask "bitwarden"                 # Password manager

# Creative & Design
cask "adobe-creative-cloud"     # Adobe Creative Cloud manager

# Productivity & Communication
cask "ankerwork"                # Video conferencing
cask "stats"                    # Free system monitoring (alternative to iStat Menus)

# Media & Entertainment
cask "spotify"                  # Music streaming
cask "vlc"                      # Media player
cask "downie"                   # Video downloader
cask "audiobook-builder"        # Audiobook creation

# Scanner Software
# No scanner software - ScanSnap iX500 discontinued for macOS Sequoia
# Alternative: Use phone scanning apps or buy new scanner

# Utilities
cask "the-unarchiver"           # Archive tool (.zip, .rar, etc)
cask "appcleaner"               # App uninstaller
cask "stats"                    # System monitor
cask "utm"
cask "balenaetcher"             # Flash OS images to SD cards & USB drives
cask "knockknock"               # See what's persistently installed on your Mac (Malware)

# Optional: Uncomment apps you want
# cask "firefox"                # Alternative browser
# cask "slack"                  # Team communication
# cask "discord"                # Gaming/community chat
# cask "spotify"                # Music streaming
# cask "notion"                 # Notes and organization
# cask "figma"                  # Design tool
# cask "1password"              # Password manager (paid)
# cask "rectangle"              # Window management
# cask "cleanmymac"             # System cleaner (paid)

# Mac App Store Apps
# Note: You need to be logged into the App Store for these to work
# Use 'mas search "app name"' to find App IDs
# mas "Xcode", id: 497799835     # Apple's development environment (15+ GB - only needed for iOS/macOS development)
mas "Pages", id: 409201541       # Apple's word processor
mas "Numbers", id: 409203825     # Apple's spreadsheet app
mas "Keynote", id: 409183694     # Apple's presentation app
mas "Strongbox", id: 897283731   # KeePass password manager
mas "Bitwarden", id: 1352778147  # Password manager
mas "Things 3", id: 904280696     # Task management app
mas "DaisyDisk", id: 411643860  	# Disk space analyzer
mas "MindSpace", id: 1585502524     # Mind mapping & diagrams (one-time purchase alternative to MindNode)
#mas "MindNode", id: 6446116532     # Mind mapping tool (for converting old files)
# mas "UGREEN NAS", id: 6458647408	# UGREEN NAS management - iOS app only

# Safari Ad Blockers
mas "1Blocker", id: 1365531024        # Safari ad blocker with customization
mas "AdGuard for Safari", id: 1440147259  # Premium ad blocker, best performance
mas "Hush", id: 1544743900            # Safari extension to block cookie banners
#mas "Wipr 2", id: 1662217862          # Minimalist Safari ad blocker
# mas "Claude by Anthropic", id: 6473753684  # Claude Desktop App (App Store - restricted)
# mas "1Password 7", id: 1333542190  # Password manager
# mas "Magnet", id: 441258766    # Window management
# mas "Pixelmator Pro", id: 1289583905  # Image editor