# Brewfile - Developer Essentials + Utilities
# Usage: brew bundle install

# Essential Command Line Tools
brew "git"                      # Version control (overrides macOS system git)
brew "curl"                     # HTTP requests  
brew "wget"                     # Downloads
brew "jq"                       # JSON processor
brew "tree"                     # Directory structure
brew "node"                     # Node.js for JavaScript development

# Better CLI Tools
brew "ripgrep"                  # Fast text search (rg)
brew "bat"                      # cat with syntax highlighting
brew "eza"                      # Better ls with colors

# Terminal Extensions  
brew "zsh-autosuggestions"      # Tab completion
brew "zsh-syntax-highlighting"  # Syntax colors in terminal

# Essential GUI Apps
cask "visual-studio-code"       # Code editor
cask "google-chrome"            # Browser with dev tools
cask "iterm2"                   # Better terminal

# macOS Development Tools
cask "sf-symbols"               # Apple's symbol library for custom icons

# Utilities
cask "the-unarchiver"           # Archive tool (.zip, .rar, etc)
cask "appcleaner"              # App uninstaller

# Optional: Uncomment apps you want
# cask "firefox"                # Alternative browser  
# cask "slack"                  # Team communication
# cask "discord"                # Gaming/community chat
# cask "spotify"                # Music streaming
# cask "notion"                 # Notes and organization
# cask "figma"                  # Design tool
# cask "1password"              # Password manager (paid)
# cask "rectangle"              # Window management
# cask "cleanmymac"             # System cleaner (paid)